Revit 2027 API
BuiltInFailures.DimensionFailures.ChangeSpotElevationFailed Property
 Can't change Spot Elevation to the desired value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChangeSpotElevationFailed { get; }
Public Shared ReadOnly Property ChangeSpotElevationFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChangeSpotElevationFailed {
	FailureDefinitionId^ get ();
}
static member ChangeSpotElevationFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace